Revit 2024 API
Ellipse.Center Property
Returns the center of the ellipse.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Center { get; }
Visual Basic
Public ReadOnly Property Center As XYZ
	Get
Visual C++
public:
property XYZ^ Center {
	XYZ^ get ();
}
See Also
Ellipse Class
Autodesk.Revit.DB Namespace